starting emulator with no elf file loaded!
to load new file: load <file> <start of memory>
emul-mips> load test/test_elf.o 0x3000

---NEW FILE LOADED:  test/test_elf.o ---
Virtual memory map (3 segments)
.text   	r-x	Vaddr: 0x00003000	Size: 24 bytes
.data   	rw-	Vaddr: 0x00004000	Size: 4 bytes
.bss    	rw-	Vaddr: 0x00005000	Size: 0 bytes

raw content of segment .text:

  0x00000000 0x2009000c 0x00005020 0x214a0001 0x1549fffe 
  0x00000010 0x00000000 0x00005020 
raw content of segment .data:

  0x00000000 0x00000004 
raw content of segment .bss:
emul-mips> set mem
ERROR 410: too few arguments for function
emul-mips> set mem asd
ERROR 410: too few arguments for function
emul-mips> set mem byte
ERROR 410: too few arguments for function
emul-mips> set mem byte fg fdf
ERROR 422: argument <address> out of bounds
emul-mips> set mem byte 12 sdj
ERROR 419: argument <value> out of bounds
emul-mips> set mem byte sds 120
ERROR 422: argument <address> out of bounds
emul-mips> set mem byte 0xFFFFFFFFFFFFFFFFFFFF 0x10
ERROR 501: address not assigned to any segment or overrides end of segment
emul-mips> set mem byte 10 15 10 289 38
ERROR 411: too many arguments for function
emul-mips> set mem byte 10 15
ERROR 501: address not assigned to any segment or overrides end of segment
emul-mips> disp mem 10
ERROR 501: address not assigned to any segment or overrides end of segment
emul-mips> exit
exiting mips emulator...
